# [作業目標]

1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```


2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

In [1]:
import pandas as pd

# 作業

### 1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```

時間為2013-01-01，欄位為A的值

時間為2013-01-01，欄位為A與B的值

時間為2013-01-01 ~ 2013-01-02，欄位為A的值

時間為2013-01-01 ~ 2013-01-05，欄位為A ~ C的值

### 2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

In [16]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd
np.random.seed(10)
df = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  1.331587  0.715279 -1.545400
1 -0.008384  0.621336 -0.720086
2  0.265512  0.108549  0.004291
3 -0.174600  0.433026  1.203037
4 -0.965066  1.028274  0.228630
5  0.445138 -1.136602  0.135137

In [19]:
df.loc[:2]

       col1      col2      col3
0  1.331587  0.715279 -1.545400
1 -0.008384  0.621336 -0.720086
2  0.265512  0.108549  0.004291

In [33]:
print(df.iloc[1::2,])

       col1      col2      col3
1 -0.008384  0.621336 -0.720086
3 -0.174600  0.433026  1.203037
5  0.445138 -1.136602  0.135137

In [32]:
df.iloc[-2:]

       col1      col2      col3
4 -0.965066  1.028274  0.228630
5  0.445138 -1.136602  0.135137

In [30]:
df.iloc[:,-2:]

       col2      col3
0  0.715279 -1.545400
1  0.621336 -0.720086
2  0.108549  0.004291
3  0.433026  1.203037
4  1.028274  0.228630
5 -1.136602  0.135137

In [34]:
df.iloc[0::2,]

       col1      col2      col3
0  1.331587  0.715279 -1.545400
2  0.265512  0.108549  0.004291
4 -0.965066  1.028274  0.228630

### 3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

In [36]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df

     0   1   2   3
0   23  38  32  35
1   22  11  35  14
2   37  28  39  23
3   32  33  34  21
4   38  20  34  19
5   25  28  26  32
6   17  34  21  27
7   24  17  21  38
8   11  30  36  10
9   34  22  15  14
10  17  34  34  28
11  22  32  12  18
12  25  23  34  25
13  39  16  32  31
14  20  32  21  26

In [39]:
#1.filtered by first column > 20?
df.loc[df[0] > 20]

     0   1   2   3
0   23  38  32  35
1   22  11  35  14
2   37  28  39  23
3   32  33  34  21
4   38  20  34  19
5   25  28  26  32
7   24  17  21  38
9   34  22  15  14
11  22  32  12  18
12  25  23  34  25
13  39  16  32  31

In [40]:
# 2. filtered by first column + second column > 50

df.loc[(df[0]+df[1]) > 50]

     0   1   2   3
0   23  38  32  35
2   37  28  39  23
3   32  33  34  21
4   38  20  34  19
5   25  28  26  32
6   17  34  21  27
9   34  22  15  14
10  17  34  34  28
11  22  32  12  18
13  39  16  32  31
14  20  32  21  26

In [45]:
# 3. filtered by first column < 30 or second column > 30

# df[np.logical_or(df[0] < 30, df[1] > 30)]
df[(df[0] < 30) | (df[1] > 30)]

     0   1   2   3
0   23  38  32  35
1   22  11  35  14
3   32  33  34  21
5   25  28  26  32
6   17  34  21  27
7   24  17  21  38
8   11  30  36  10
10  17  34  34  28
11  22  32  12  18
12  25  23  34  25
14  20  32  21  26

In [46]:
# - 4. filtered by total sum of row > 100

df[df.sum(axis=1) > 100]

     0   1   2   3
0   23  38  32  35
2   37  28  39  23
3   32  33  34  21
4   38  20  34  19
5   25  28  26  32
10  17  34  34  28
12  25  23  34  25
13  39  16  32  31